using System;
using System.Collections.Generic;
using System.Text;
using System.Collections;

namespace SearchEngine.Analysis.Rule
{
    /// <summary>
    /// 姓氏规则
    /// </summary>
    public class FamilyNameRule
    {
        private static string[] FAMILY_NAMES = {
            "王","张","黄","周","徐",
            "胡","高","林","马","于",
            "程","傅","曾","叶","余",
            "夏","钟","田","任","方",
            "石","熊","白","毛","江",
            "史","候","龙","万","段",
            "雷","钱","汤","易","常",
            "武","赖","文","查","满",
            "赵","肖","孙","李","梅",
            "吴","郑","冯","陈","眉",
            "褚","卫","蒋","沈","那",
            "韩","杨","朱","秦","牛",
            "尤","许","何","吕","朴",
            "施","桓","孔","曹","姬",
            "严","华","金","魏","童",
            "陶","姜","戚","谢","涂",
            "邹","喻","柏","窦","温",
            "苏","潘","葛","奚","翁",
            "范","彭","鲁","韦","伍",
            "昌","俞","袁","酆","古",
            "鲍","唐","费","廉","元",
            "岑","薛","贺","倪","岳",
            "滕","殷","罗","毕","蓝",
            "郝","邬","卞","康","水",
            "卜","顾","孟","穆","桃",
            "萧","尹","姚","邵","兰",
            "湛","汪","祁","禹","阿",
            "狄","贝","臧","伏","单",
            "戴","宋","茅","庞","苟",
            "纪","舒","屈","祝","游",
            "董","梁","杜","阮","曲",
            "闵","贾","娄","颜","归",
            "郭","邱","骆","蔡","莫",
            "樊","凌","霍","虞","解",
            "柯","昝","卢","竺","成",
            "缪","宗","丁","贲","展",
            "邓","郁","杭","洪","冷",
            "崔","龚","嵇","邢","简",
            "滑","裴","陆","荣","齐",
            "荀","惠","甄","芮","妫",
            "羿", "储", "靳", "汲", 
            "邴", "糜", "隗", "侯",
            "宓", "蓬", "郗", "仲",
            "栾", "钭", "历", "戎",
            "刘", "詹", "幸", "韶",
            "郜", "黎", "蓟", "溥",
            "蒲", "邰", "鄂", "咸",
            "卓", "蔺", "屠", "乔",
            "盍", "胥", "苍", "莘",
            "翟", "谭", "贡", "劳",
            "冉", "郦", "雍", "璩",
            "桑", "桂", "濮", "扈",
            "冀", "浦", "庄", "晏",
            "瞿", "阎", "慕", "茹",
            "习", "宦", "艾", "容",
            "慎", "戈", "廖", "庾",
            "衡", "耿", "弘", "匡",
            "阙", "殳", "沃", "蔚",
            "夔", "隆", "巩", "聂",
            "晁", "敖", "融", "訾",
            "辛", "阚", "毋", "乜",
            "丰", "蒯", "荆", "章",
            "司空", "万俟", "慕容",
            "司马", "上官", "欧阳",
            "夏侯", "诸葛", "闻人",
            "东方", "赫连", "皇甫",
            "尉迟", "公羊", "澹台",
            "公冶", "宗政", "濮阳",
            "淳于", "单于", "太叔",
            "申屠", "公孙", "仲孙",
            "轩辕", "令狐", "徐离",
            "宇文", "长孙", "司徒",
            "拓跋", "完颜", "乞伏",
            "耶律"
        };

        private static Hashtable m_FamilyNameTbl = new Hashtable();

        /// <summary>
        /// 姓氏检测
        /// </summary>
        /// <param name="hashCode">汉字的HASH编码</param>
        /// <returns></returns>
        public static bool Test(int hashCode)
        {
            if (m_FamilyNameTbl.Count == 0)
            {
                foreach (String familyName in FAMILY_NAMES)
                {
                    Char[] cs = familyName.ToCharArray();
                    int code = (int)cs[0];
                    if (cs.Length > 1)
                    {
                        code = (code << 2) + (int)cs[1];
                    }
                    m_FamilyNameTbl.Add(code, null);
                }
            }
            return m_FamilyNameTbl.ContainsKey(hashCode);
        }
    }
}
